// Напишите программу, которая на вход
//принимает число (N), а на выходе показывает все чётные
//числа от 1 до N.
Console.Clear();
Console.WriteLine("Введите число");
int a = int.Parse(Console.ReadLine());
//int count = 2;
for (int i = 2; i < a; i+=2)
{
    Console.Write(i+" ");
}       
            
//Console.WriteLine(count);
//while(count < a)
//{
  //   Console.WriteLine(count);
    // count = count + 2;
    //}
    

//for (int count = 1; count < a; count++)       
//if (count%2==0)            






